proyecto/app/views/assignments/_form.html.erb

    <%= f.label :document_id %>
    <%= f.select :document_id, options_for_select(Document.all.map{|s|[s.to_s, s.id]}), class: "form-control"  %>
---
SELECT "documents".* FROM "documents"

    <%= f.label :category_id %>
    <%= f.select :category_id, options_for_select(Category.all.map{|s|[s.to_s, s.id]}), class: "form-control"  %>
---
SELECT "categories".* FROM "categories"