proyecto/app/controllers/assignments_controller.rb

INSERT INTO "assignments" ("document_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["document_id", 1], ["category_id", 1], ["created_at", "2017-05-16 17:28:44.677640"], ["updated_at", "2017-05-16 17:28:44.677640"]]
---
  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save

DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 1]]
---
  def destroy
    @assignment.destroy