proyecto/app/controllers/documents_controller.rb

  def index
    if !params[:search].nil?
      @documents = Document.where("title like ?", "%#{params[:search]}%")
    else
      @documents = Document.all
---
SELECT "documents".* FROM "documents" WHERE (is_public  = 't') ORDER BY created_at DESC
SELECT "documents".* FROM "documents" ORDER BY created_at DESC

  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save
---
INSERT INTO "documents" ("title", "text", "created_at", "updated_at", "is_public") VALUES (?, ?, ?, ?, ?)  [["title", "Publico si"], ["text", "asfdsdafsdaasfdfads"], ["created_at", "2017-05-31 01:17:53.013946"], ["updated_at", "2017-05-31 01:17:53.013946"], ["is_public", "t"]]

  def update
    respond_to do |format|
      if @document.update(document_params)
---
UPDATE "documents" SET "text" = ?, "is_public" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["text", "ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd"], ["is_public", "t"], ["updated_at", "2017-06-01 23:25:18.500018"], ["id", 2]]

  def destroy
    @document.destroy
---
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 1]]