proyecto/app/controllers/managements_controller.rb

SELECT "managements".* FROM "managements" WHERE (person_id = current_person.id)
---
  def index
    @managements = Management.all

INSERT INTO "managements" ("person_id", "document_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["person_id", 1], ["document_id", 1], ["created_at", "2017-05-16 17:25:02.754627"], ["updated_at", "2017-05-16 17:25:02.754627"]]
---
  def create
    @management = Management.new(management_params)

    respond_to do |format|
      if @management.save

DELETE FROM "managements" WHERE "managements"."id" = ?  [["id", 1]]
---
  def destroy
    @management.destroy

SELECT  "managements".* FROM "managements" WHERE "managements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_management
      @management = Management.find(params[:id])