proyecto/app/controllers/suggestions_controller.rb

  def index
    @suggestions = Suggestion.all
---
SELECT "suggestions".* FROM "suggestions" WHERE (status LIKE '%Implemented%') ORDER BY created_at DESC

  def create
    @suggestion = Suggestion.new(suggestion_params)

    respond_to do |format|
      if @suggestion.save
---
INSERT INTO "suggestions" ("document_id", "person_id", "text", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["document_id", 3], ["person_id", 2], ["text", "dfsdfdsfsdf"], ["status", "Pending"], ["created_at", "2017-06-13 22:33:03.346145"], ["updated_at", "2017-06-13 22:33:03.346145"]]

    def set_suggestion
      @suggestion = Suggestion.find(params[:id])
---
SELECT  "suggestions".* FROM "suggestions" WHERE "suggestions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]