proyecto/app/views/managements/_form.html.erb

SELECT "documents".* FROM "documents"
---
    <%= f.label :document_id %>
    <%= f.select :document_id, options_for_select(Document.all.map{|s|[s.to_s, s.id]}) %>